#### DB Connection

In [6]:
import sqlite3

conn = sqlite3.connect('test.db')

#### Creating a Table COMPANY

In [10]:
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully")

Opened database successfully
Table created successfully

#### Inserting Values INTO COMPANT Table

In [11]:
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()

#### Fetching the data from Database

In [29]:
#printing data using Pandas
query = "SELECT * FROM COMPANY"
df = pd.read_sql(query, conn)
print(df)

   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  20000.0
1   2  Allen   25       Texas  15000.0
2   3  Teddy   23      Norway  20000.0
3   4   Mark   25  Rich-Mond   65000.0

#### Updating Table Company

In [30]:
conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1")
conn.commit

In [31]:
query = "SELECT * FROM COMPANY"
df = pd.read_sql(query, conn)
print(df)

   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  25000.0
1   2  Allen   25       Texas  15000.0
2   3  Teddy   23      Norway  20000.0
3   4   Mark   25  Rich-Mond   65000.0

#### Deleting rows from Company  table

In [33]:
conn.execute("DELETE from COMPANY where ID = 2")
conn.commit

In [34]:
query = "SELECT * FROM COMPANY"
df = pd.read_sql(query, conn)
print(df)

   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  25000.0
1   3  Teddy   23      Norway  20000.0
2   4   Mark   25  Rich-Mond   65000.0

#### Query1:Get all the details of employee who earn more than 20k

In [36]:
query1="SELECT * FROM COMPANY WHERE SALARY>20000"
df = pd.read_sql(query1, conn)
print(df)

   ID  NAME  AGE     ADDRESS   SALARY
0   1  Paul   32  California  25000.0
1   4  Mark   25  Rich-Mond   65000.0

#### Query2: Find the id,name and age of employee whose age is more than 25 year

In [37]:
query2 = "SELECT ID,NAME,AGE  FROM COMPANY WHERE AGE>25"
df = pd.read_sql(query2, conn)
print(df)

   ID  NAME  AGE
0   1  Paul   32